# Advanced Dataframes

In this lesson we will continue working with pandas DataFrames, and explore some more complex DataFrame manipulations.

In [1]:
import pandas as pd
import numpy as np

np.random.seed(123)

In [2]:
# Create list of values for names column.

students = ['Sally', 'Jane', 'Suzie', 'Billy', 'Ada', 'John', 'Thomas',
            'Marie', 'Albert', 'Richard', 'Isaac', 'Alan']

# Randomly generate arrays of scores for each student for each subject.
# Note that all the values need to have the same length here.

math_grades = np.random.randint(low=60, high=100, size=len(students))
english_grades = np.random.randint(low=60, high=100, size=len(students))
reading_grades = np.random.randint(low=60, high=100, size=len(students))

In [3]:
# Construct the DataFrame using the above lists and arrays.

df = pd.DataFrame({'name': students,
                   'math': math_grades,
                   'english': english_grades,
                   'reading': reading_grades,
                   'classroom': np.random.choice(['A', 'B'], len(students))})

In [4]:
#df.to_csv('students.csv'), creates and saves the dataframe to your local drive
#df = pd.read_csv(students.csv) reads it in, df becomes the reference name

## Creating Dataframes

### From Lists and Dictionaries

There are several ways to create dataframes, we've already seen how we can create a dataframe from a dictionary:

In [5]:
pd.DataFrame({'A': [1, 2, 3], 'B': [4, 5, 6]})

   A  B
0  1  4
1  2  5
2  3  6

The keys in the passed dictionary will be the column names, and the values are the data points that make up each column.

We can also create dataframes from a 2d data structure, either a numpy array or a list of lists:

In [6]:
pd.DataFrame([[1, 2, 3], [4, 5, 6]])

   0  1  2
0  1  2  3
1  4  5  6

In [7]:
array = np.array([[1, 2, 3], [4, 5, 6]])

pd.DataFrame(array, columns=['a', 'b', 'c'])

   a  b  c
0  1  2  3
1  4  5  6

Notice here that we had to specify the names of the columns ourselves.

### From PyDataset.

In some of the exercises, you'll need to load several datasets using the `pydataset` library. (If you get an error when trying to run the import below, use `pip` to install the `pydataset` package.) When the instructions say to load a dataset from PyDataset, you will need to do the following:

The following import is necessary to access PyDataset datasets:
```python
from pydataset import data
```

Running this code snippet will show you the valuable information doc on the dataset:
```python
data(df_string_name, show_doc=True)
```

Running this code snippet will load the dataset for use as a pandas DataFrame:
```python
df = data(df_string_name)
```

There are 757 available datasets using pydataset. Running the following code snippet in a cell will return a DataFrame with all of your options:
```python
data()
```

In [8]:
# Load the dataset and store it in the variable mpg.

from pydataset import data
mpg = data('mpg')
mpg.head()

  manufacturer model  displ  year  cyl       trans drv  cty  hwy fl    class
1         audi    a4    1.8  1999    4    auto(l5)   f   18   29  p  compact
2         audi    a4    1.8  1999    4  manual(m5)   f   21   29  p  compact
3         audi    a4    2.0  2008    4  manual(m6)   f   20   31  p  compact
4         audi    a4    2.0  2008    4    auto(av)   f   21   30  p  compact
5         audi    a4    2.8  1999    6    auto(l5)   f   16   26  p  compact

You can view the documentation for the dataset, and any pydata dataset, by setting show_doc to True. This outputs valuable context for your dataset.

```python
data('mpg', show_doc=True) 
```

### From SQL

We can use the `read_sql` method to create a dataframe based on the results of a SQL query. To do this, we need to tell pandas how to connect to the database we are querying. The way we communicate this to pandas is with a specially formatted *connection string*.

In addition, whenever we want to connect to a database from our python code (other programming languages are similar), we will need a **driver**, a bit of software that handles the details of the database connection.

In order to connect to mysql, we'll install the `mysqlclient` and `pymysql` driver packages:

`python -m pip install mysqlclient pymysql`

Once those are installed, we can create the connection string. In general, database connection urls will have this format:

```python
protocol://[user[:password]@]hostname/[database_name]
```

Here's an example of what one would look like:

```python
mysql+pymysql://codeup:p@assw0rd@123.123.123.123/some_db
```

Another thing we need to consider is that we don't want to publish our database credentials to github, however, we will need access to these values in our code in order to create the connection string defined above.

In order to accomplish this, we can define several variables in a file named `env.py` that contain the sensitive data, add `env.py` to our `.gitignore` file, and then import those values into another script. 

**Be 100% sure to add `env.py` to this specific repository's `.gitignore` file, even and especially, if you have already added `env.py` to your global .gitignore file. This will protect the env file for people who clone this project (like collaborators)**

In [9]:
from env import host, user, password

url = f'mysql+pymysql://{user}:{password}@{host}/employees'

Once this url is defined, we can use it with the `read_sql` function to have pandas treat the results of a SQL query as a dataframe.

In [10]:
pd.read_sql('SELECT * FROM employees LIMIT 5 OFFSET 50', url)

   emp_no  birth_date first_name  last_name gender   hire_date
0   10051  1953-07-28   Hidefumi      Caine      M  1992-10-15
1   10052  1961-02-26     Heping     Nitsch      M  1988-05-21
2   10053  1954-09-13     Sanjiv   Zschoche      F  1986-02-04
3   10054  1957-04-04     Mayumi  Schueller      M  1995-03-13
4   10055  1956-06-06     Georgy     Dredge      M  1992-04-27

It is common to have longer SQL queries that we want to read into python, and an example of how we might break a query into several lines is below:

In [11]:
sql = '''
SELECT
    emp_no,
    first_name,
    last_name
FROM employees
WHERE gender = 'F'
LIMIT 100
'''

employees = pd.read_sql(sql, url)
employees.head()

   emp_no first_name  last_name
0   10002    Bezalel     Simmel
1   10006     Anneke    Preusig
2   10007    Tzvetan  Zielinski
3   10009     Sumant       Peac
4   10010  Duangkaew   Piveteau

> Don't add and commit files with passwords or other sensitive information in them to a git repository!

In [12]:
query = '''
SELECT
    t.title as title,
    d.dept_name as dept_name
FROM titles t
JOIN dept_emp USING (emp_no)
JOIN departments d USING (dept_no)
LIMIT 100
'''

title_dept = pd.read_sql(query, url)
title_dept.head()

          title         dept_name
0         Staff  Customer Service
1  Senior Staff  Customer Service
2         Staff  Customer Service
3  Senior Staff  Customer Service
4         Staff  Customer Service

## Exercises I

Run `python -m pip install mysqlclient pymysql` from your terminal to install pymysql and the mysqlclient.

Create a notebook or python script named `advanced_dataframes` to do your work in for these exercises.

1. Run `python -m pip install mysqlclient pymysql` from your terminal to install the mysql client (any folder is fine)
1. cd into your exercises folder for this module and run `echo env.py >> .gitignore`
1. Create a function named `get_db_url`. It should accept a username, hostname, password, and database name and return a url connection string formatted like in the example at the start of this lesson.
1. Use your function to obtain a connection to the `employees` database.
1. Once you have successfully run a query:
    - Intentionally make a typo in the database url. What kind of error message do you see?
    - Intentionally make an error in your SQL query. What does the error message look like?
6. Read the `employees` and `titles` tables into two separate DataFrames.
7. How many rows and columns do you have in each DataFrame? Is that what you expected?
8. Display the summary statistics for each DataFrame.
9. How many unique titles are in the `titles` DataFrame?
10. What is the oldest date in the `to_date` column? 
11. What is the most recent date in the `to_date` column?

In [13]:
from env import host, user, password

In [14]:
def get_db_url():
    from env import host, user, password
    url = f'mysql+pymysql://{user}:{password}@{host}/employees'
    return url

In [15]:
url = f'mysql+pymysql://{user}:{password}@{host}/employees'

In [16]:
url

'mysql+pymysql://mirzakhani_1932:WykPdp72Ml1HxyjPG8rT2u6hRbjpd7rI@data.codeup.com/employees'

In [17]:
pd.read_sql('SELECT * FROM employees LIMIT 5 OFFSET 50', url)

   emp_no  birth_date first_name  last_name gender   hire_date
0   10051  1953-07-28   Hidefumi      Caine      M  1992-10-15
1   10052  1961-02-26     Heping     Nitsch      M  1988-05-21
2   10053  1954-09-13     Sanjiv   Zschoche      F  1986-02-04
3   10054  1957-04-04     Mayumi  Schueller      M  1995-03-13
4   10055  1956-06-06     Georgy     Dredge      M  1992-04-27

In [18]:
sql = '''
SELECT
    *
FROM employees
'''

employees_df = pd.read_sql(sql, url)

In [19]:
employees_df

        emp_no  birth_date first_name last_name gender   hire_date
0        10001  1953-09-02     Georgi   Facello      M  1986-06-26
1        10002  1964-06-02    Bezalel    Simmel      F  1985-11-21
2        10003  1959-12-03      Parto   Bamford      M  1986-08-28
3        10004  1954-05-01  Chirstian   Koblick      M  1986-12-01
4        10005  1955-01-21    Kyoichi  Maliniak      M  1989-09-12
...        ...         ...        ...       ...    ...         ...
300019  499995  1958-09-24     Dekang  Lichtner      F  1993-01-12
300020  499996  1953-03-07       Zito      Baaz      M  1990-09-27
300021  499997  1961-08-03    Berhard    Lenart      M  1986-04-21
300022  499998  1956-09-05   Patricia   Breugel      M  1993-10-13
300023  499999  1958-05-01     Sachin   Tsukuda      M  1997-11-30

[300024 rows x 6 columns]

In [20]:
pd.read_sql('SELECT * FROM titles LIMIT 5 OFFSET 50', url)

   emp_no            title   from_date     to_date
0   10036     Senior Staff  1992-04-28  9999-01-01
1   10037         Engineer  1990-12-05  1995-12-05
2   10037  Senior Engineer  1995-12-05  9999-01-01
3   10038     Senior Staff  1996-09-20  9999-01-01
4   10038            Staff  1989-09-20  1996-09-20

In [21]:

sql = '''
SELECT
    *
FROM titles
'''

titles_df = pd.read_sql(sql, url)

In [22]:
titles_df

        emp_no            title   from_date     to_date
0        10001  Senior Engineer  1986-06-26  9999-01-01
1        10002            Staff  1996-08-03  9999-01-01
2        10003  Senior Engineer  1995-12-03  9999-01-01
3        10004         Engineer  1986-12-01  1995-12-01
4        10004  Senior Engineer  1995-12-01  9999-01-01
...        ...              ...         ...         ...
443303  499997         Engineer  1987-08-30  1992-08-29
443304  499997  Senior Engineer  1992-08-29  9999-01-01
443305  499998     Senior Staff  1998-12-27  9999-01-01
443306  499998            Staff  1993-12-27  1998-12-27
443307  499999         Engineer  1997-11-30  9999-01-01

[443308 rows x 4 columns]

In [ ]:
titles_df.describe()

In [ ]:
employees_df.describe()

In [ ]:
#what is the most recent date in the 'to_date' column?
titles_df['to_date'].max()

In [ ]:
# What is the oldest date in the `to_date` column? 
titles_df['to_date'].min()

In [ ]:
# how many unique titles?
titles_df['title'].unique()

# Exercises Part 2

1. Copy the users and roles DataFrames from the examples above.
2. What is the result of using a right join on the DataFrames?
3. What is the result of using an outer join on the DataFrames?
4. What happens if you drop the foreign keys from the DataFrames and try to merge them?
5. Load the mpg dataset from PyDataset.
6. Output and read the documentation for the mpg dataset.
7. How many rows and columns are in the dataset?
8. Check out your column names and perform any cleanup you may want on them.
9. Display the summary statistics for the dataset.
10. How many different manufacturers are there?
11. How many different models are there?
12. Create a column named mileage_difference like you did in the DataFrames exercises; this column should contain the difference between highway and city mileage for each car.
13. Create a column named average_mileage like you did in the DataFrames exercises; this is the mean of the city and highway mileage.
14. Create a new column on the mpg dataset named is_automatic that holds boolean values denoting whether the car has an automatic transmission.
15. Using the mpg dataset, find out which which manufacturer has the best miles per gallon on average?
16. Do automatic or manual cars have better miles per gallon?

In [ ]:
users = pd.DataFrame({
    'id': [1, 2, 3, 4, 5, 6],
    'name': ['bob', 'joe', 'sally', 'adam', 'jane', 'mike'],
    'role_id': [1, 2, 3, 3, np.nan, np.nan]
})
users

In [ ]:
roles = pd.DataFrame({
    'id': [1, 2, 3, 4],
    'name': ['admin', 'author', 'reviewer', 'commenter']
})
roles

In [ ]:
# right join
users.merge(roles, left_on='role_id', right_on='id', how='outer', indicator=True)

In [ ]:
#outer join
pd.concat([roles, users], axis=1, join = 'outer')

In [ ]:
# drop foreign keys
(users.merge(roles, 
            left_on='role_id', 
            right_on='id', 
            how='outer')
    .drop(columns='role_id')
    .rename(columns={'id_x': 'id', 
                     'name_x': 'employee',
                     'id_y': 'role_id',
                     'name_y': 'role'}
            )
)

In [ ]:
mpg = data('mpg')

In [ ]:
mpg

In [ ]:
mpg.info()

In [ ]:
mpg.shape

In [ ]:
mpg.head()

In [ ]:
mpg.rename(columns = {'cyl': 'cylinders'}, inplace = True)
mpg.rename(columns = {'drv': 'wh_drv'}, inplace = True)
mpg.rename(columns = {'cty': 'city'}, inplace = True)
mpg.rename(columns = {'hwy': 'highway'}, inplace = True)
mpg.rename(columns = {'fl': 'fuel'}, inplace = True)

In [ ]:
mpg

In [ ]:
mpg.describe()

In [ ]:
len(mpg['manufacturer'].unique())

In [ ]:
len(mpg['model'].unique())

In [ ]:

mpg['mileage_difference'] = (mpg.highway - mpg.city)

In [ ]:
mpg["average_mileage"] = (mpg.highway + mpg.city) /2

In [ ]:
mpg

In [ ]:
mpg['is_automatic'] = mpg.trans.str.startswith('auto')

In [ ]:
mpg

In [ ]:
max(mpg.groupby("manufacturer").average_mileage.mean())

In [ ]:
mpg.groupby("is_automatic").average_mileage.mean()

# exercise 3

In [33]:
from pydataset import data
import pandas as pd
import numpy as np
from env import host, user, password

In [34]:
from env import host, user, password
def get_db_url():
    from env import host, user, password
    url = f'mysql+pymysql://{user}:{password}@{host}/chipotle'
    return url
url = f'mysql+pymysql://{user}:{password}@{host}/chipotle'

url

'mysql+pymysql://mirzakhani_1932:WykPdp72Ml1HxyjPG8rT2u6hRbjpd7rI@data.codeup.com/chipotle'

In [35]:
pd.read_sql('SELECT * FROM orders LIMIT 5 OFFSET 50', url)

,id,order_id,quantity,item_name,choice_description,item_price
0,51,23,1,Steak Burrito,"[Roasted Chili Corn Salsa (Medium), [Rice, Fajita Veggies, Cheese, Sour Cream, Lettuce]]",$8.99
1,52,23,2,Canned Soda,[Mountain Dew],$2.18
2,53,24,1,Chicken Burrito,"[Roasted Chili Corn Salsa (Medium), [Black Beans, Rice, Fajita Veggies, Cheese, Sour C...",$10.98
3,54,24,1,Canned Soda,[Sprite],$1.09
4,55,25,1,Steak Bowl,"[Fresh Tomato Salsa (Mild), [Black Beans, Rice, Fajita Veggies, Cheese, Sour Cream]]",$8.99

In [36]:
sql = '''
SELECT
    *
FROM orders
'''

orders_df = pd.read_sql(sql, url)

In [37]:
orders_df

,id,order_id,quantity,item_name,choice_description,item_price
0,1,1,1,Chips and Fresh Tomato Salsa,nan,$2.39
1,2,1,1,Izze,[Clementine],$3.39
2,3,1,1,Nantucket Nectar,[Apple],$3.39
3,4,1,1,Chips and Tomatillo-Green Chili Salsa,nan,$2.39
4,5,2,2,Chicken Bowl,"[Tomatillo-Red Chili Salsa (Hot), [Black Beans, Rice, Cheese, Sour Cream]]",$16.98
...,...,...,...,...,...,...
4617,4618,1833,1,Steak Burrito,"[Fresh Tomato Salsa, [Rice, Black Beans, Sour Cream, Cheese, Lettuce, Guacamole]]",$11.75
4618,4619,1833,1,Steak Burrito,"[Fresh Tomato Salsa, [Rice, Sour Cream, Cheese, Lettuce, Guacamole]]",$11.75
4619,4620,1834,1,Chicken Salad Bowl,"[Fresh Tomato Salsa, [Fajita Vegetables, Pinto Beans, Guacamole, Lettuce]]",$11.25
4620,4621,1834,1,Chicken Salad Bowl,"[Fresh Tomato Salsa, [Fajita Vegetables, Lettuce]]",$8.75
4621,4622,1834,1,Chicken Salad Bowl,"[Fresh Tomato Salsa, [Fajita Vegetables, Pinto Beans, Lettuce]]",$8.75

In [38]:
orders_df.groupby('order_id').item_price.sum()

order_id
1       $2.39 $3.39 $3.39 $2.39
2                        $16.98
3                  $10.98 $1.69
4                  $11.75 $9.25
5                   $9.25 $4.45
                  ...
1830              $11.75 $11.25
1831          $9.25 $2.15 $1.50
1832                $8.75 $4.45
1833              $11.75 $11.75
1834         $11.25 $8.75 $8.75
Name: item_price, Length: 1834, dtype: object

In [39]:
orders_df['item_price'] = orders_df['item_price'].str.replace('$','').astype(float)

/var/folders/h3/mf3_948d1xn0mgz6l997fvlw0000gn/T/ipykernel_24775/606927646.py:1: FutureWarning: The default value of regex will change from True to False in a future version. In addition, single character regular expressions will *not* be treated as literal strings when regex=True.
  orders_df['item_price'] = orders_df['item_price'].str.replace('$','').astype(float)

In [50]:
# total price per order
order_totals = orders_df.groupby('order_id').item_price.sum()
order_totals

order_id
1       11.56
2       16.98
3       12.67
4       21.00
5       13.70
        ...
1830    23.00
1831    12.90
1832    13.20
1833    23.50
1834    28.75
Name: item_price, Length: 1834, dtype: float64

In [41]:
#What are the most popular 3 items?
len(orders_df.groupby('item_name'))

50

In [42]:
#item_purchase_count = chipotle.groupby("item_name").order_id.count()

#item_purchase_count[item_purchase_count == item_purchase_count.max()]

In [43]:
purchase_count = orders_df.groupby('item_name').quantity.sum().nlargest()

In [44]:
# ANSWER TO TOP THREE SOLD ITEMS
purchase_count = orders_df.groupby('item_name').quantity.sum().nlargest(3)
purchase_count

item_name
Chicken Bowl           761
Chicken Burrito        591
Chips and Guacamole    506
Name: quantity, dtype: int64

In [45]:
#Which item has produced the most revenue?
highest_revenue = orders_df.groupby('item_name').item_price.sum().nlargest(1)
highest_revenue

item_name
Chicken Bowl    7342.73
Name: item_price, dtype: float64


### using employees DB

In [11]:
import datetime as dt
date=dt.date.today
import pydataset as pd

In [12]:
#join employees and titles data frames
emp_titles_df = pd.concat([titles_df, employees_df], axis=1, join = 'outer')
emp_titles_df

AttributeError: module 'pydataset' has no attribute 'concat'

In [13]:
#For each title, find the hire date of the employee that was hired most recently with that title.
emp_titles_df.groupby('title').hire_date.max()

NameError: name 'emp_titles_df' is not defined

In [14]:
# 7. Write the code necessary to create a cross tabulation of the number of titles by department. 
dept_title_query = '''
                    SELECT t.emp_no,
                    t.title,
                    t.from_date,
                    t.to_date,
                    d.dept_name
                    FROM departments AS d
                    JOIN dept_emp AS de USING(dept_no)
                    JOIN titles AS t USING(emp_no);

'''

In [15]:
dept_titles = pd.read_sql(dept_title_query, get_db_url('employees'))
dept_titles.head()

AttributeError: module 'pydataset' has no attribute 'read_sql'

In [16]:
all_titles_crosstab = pd.crosstab(
    dept_titles.dept_name, dept_titles.title)

AttributeError: module 'pydataset' has no attribute 'crosstab'

In [17]:
current_titles = dept_titles[dept_titles.to_date == dept_titles.to_date.max()]
current_titles.head()

NameError: name 'dept_titles' is not defined

In [ ]:
current_titles_crosstab = pd.crosstab(current_titles.dept_name, current_titles.title)
current_titles_crosstab